# 네이버 API
#Api가 뭔가요? Application Programming Interface
#   라이브러리 접근하기 위한 규칙들을 정의한것
#   라이브러리의 여러 함수를 이용해서 프로그램을 작성할때
#   해당 함수의 구조는 알 필요없이
#   단순히 api 정의된 형식에 맞춰 ㅇ비력값을 주고
#   결과값을 받아서 사용하면됨
#   각회사마다 다른 api/ api 규칙이다름
################################################################################
#Open api
#   특정 서비스를 제공하는 서비스 업체가
#   자신들의 서비스에 접근할수있도록 그 방법을 외부에 공개하느것
#   해당 서비스로 접근하기 위한 규칙을 정의한 것 공개

#매쉬웝 mashup
#   기존의 api 이용해서 새로운 프로그램 만든 것
#   대표적인 사례 : 구글의 하우징 맵스 서비스
#       구글지도와 부동산 매물 정보가 결합된 서비스

#국내에서 다양한  Open API 제공
#   네이버 오픈 open API
#   정부 공공 데이터 포털 (https://www.data.go.kr/)
#   우체국의 우편번호 api
# 여러개해보자..
#네이버 오픈 api
# 인증 여부에 따라 구분하면 2가지 방식
# 1) 로그인 방식 오픈 api
#----네이버 아이디로 로그인 인증을 받아 접근 토큰 access token을 획득해야 사용할 수 있는 오픈 api
# 회원 기본정보조회, 블로그 글쓰기, 카페 가입 및 글쓰기 등의 기능을 구현할때 사용
# 2) 비로그인 방식 오픈 api
#    http 헤더에 클라이언트 아이디와 클라이언트 시크랎만 전송해서 사용할수있는 오픈 api
#   네이버 아이디로 로그인의 인증을 통한 접근 토큰을 획득할 필요 없음
#   검색/공유하기/지도 등의 오픈 api
#   우리가 실습할 때 사용하는 방식
#   client ID 와 cline secret 을 발급
#   네이버 개발자 센터 에서 발급 받음










































































