# html 문서에서 원하는 내용 추출
# -필요한 내용만 추출
# - beautiful soup 라이브러리 사용
# - find ()/findAll() 함수 사용

#find()  지정한 태그중 첫번째 만나는 태그만추출 1개만
#findAll/ find_all
# -지정한 태그 모두 찾아서 추출


# BeautifulSoup
# - 데이터 추출하는데 필요한 기능이 들어있는 라이브러리
# - 파싱 라이브러리 (구문 분석)
# - 외부 라이브러리  설치필요

# 클래스 선택시 css 특정부분에만 필요한 css 적용시 사용
# 사용 도트 선택자

# u
# div 블럭형식으로 공간분할
# 밑으로 옆으로?
# 빅박스 안에 박스123...
#  태그... 의미 역할.?
# css
# 단계쩍 스타일적용
# 여러스탕리 겹치면 맨마지막 스타일적용
# 문자내 글꼴크기색배경테두리 레이아웃 엽개등
# 글자정렬방식글자그림자 애니메이션
# ##
# css 문서의 특정부분에만 필요한 css 적용시 사용
# 필요한 부분에 유일한 아이디를 지정하고 css 적용
# 식별선택자이다
# id(속성명 속성값)
